In [84]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Series

In [85]:
data = [1,2,3,4,5]

In [86]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [87]:
index = ['Linea' + str(i) for i in range(5)]
index

['Linea0', 'Linea1', 'Linea2', 'Linea3', 'Linea4']

In [88]:
s = pd.Series(data = data, index = index)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

In [89]:
data = {'Linea' + str(i) : i + 1 for i in range(5)}
data

{'Linea0': 1, 'Linea1': 2, 'Linea2': 3, 'Linea3': 4, 'Linea4': 5}

In [90]:
s = pd.Series(data)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

In [91]:
s1 = s + 2
s1

Linea0    3
Linea1    4
Linea2    5
Linea3    6
Linea4    7
dtype: int64

In [92]:
s2 = s + s1
s2

Linea0     4
Linea1     6
Linea2     8
Linea3    10
Linea4    12
dtype: int64

In [93]:
s2 = s * s1
s2

Linea0     3
Linea1     8
Linea2    15
Linea3    24
Linea4    35
dtype: int64

In [94]:
s2 = s / s1
s2

Linea0    0.333333
Linea1    0.500000
Linea2    0.600000
Linea3    0.666667
Linea4    0.714286
dtype: float64

In [95]:
s2 = s ** s1
s2

Linea0        1
Linea1       16
Linea2      243
Linea3     4096
Linea4    78125
dtype: int64

In [96]:
s2 = s % s1
s2

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

DataFrame

In [97]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [98]:
df1 = pd.DataFrame(data=data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [99]:
index = ['Linea' + str(i) for i in range(3)]
index

['Linea0', 'Linea1', 'Linea2']

In [100]:
df1 = pd.DataFrame(data=data, index=index)
df1

        0  1  2
Linea0  1  2  3
Linea1  4  5  6
Linea2  7  8  9

In [101]:
columns = ['Columna' + str(i) for i in range(3)]
columns

['Columna0', 'Columna1', 'Columna2']

In [102]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [103]:
data1 = [['Juan','Zoe','Pam'],['Nick','July','Rocky'],['Flor','Juanma','Julieta']]
data1

[['Juan', 'Zoe', 'Pam'],
 ['Nick', 'July', 'Rocky'],
 ['Flor', 'Juanma', 'Julieta']]

In [104]:
usuarios = pd.DataFrame(data=data1)
usuarios

      0       1        2
0  Juan     Zoe      Pam
1  Nick    July    Rocky
2  Flor  Juanma  Julieta

In [105]:
indice = ['Nombre' + str(i) for i in range(3)]
indice

['Nombre0', 'Nombre1', 'Nombre2']

In [106]:
usuarios = pd.DataFrame(data=data1, index=indice)
usuarios

            0       1        2
Nombre0  Juan     Zoe      Pam
Nombre1  Nick    July    Rocky
Nombre2  Flor  Juanma  Julieta

In [107]:
usuario = ['Usuario' + str(i) for i in range(3)]
usuario

['Usuario0', 'Usuario1', 'Usuario2']

In [108]:
usuarios = pd.DataFrame(data=data1, index=indice, columns=usuario)
usuarios

        Usuario0 Usuario1 Usuario2
Nombre0     Juan      Zoe      Pam
Nombre1     Nick     July    Rocky
Nombre2     Flor   Juanma  Julieta

In [109]:
data = {
    'Columna0':{'Linea0':1, 'Linea1':4, 'Linea2':7},
    'Columna1':{'Linea0':2, 'Linea1':5, 'Linea2':8},
    'Columna2':{'Linea0':3, 'Linea1':6, 'Linea2':9}
}
data

{'Columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'Columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'Columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [110]:
df2 = pd.DataFrame(data=data)
df2

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [111]:
data2 = [(1,2,3),(4,5,6),(7,8,9)]
data2

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [112]:
df3 = pd.DataFrame(data=data2, index= index, columns=columns)
df3

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [113]:
df1[df1 > 0] = 'A'
df1

C:\Users\DELL\AppData\Local\Temp\ipykernel_3108\306497466.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1[df1 > 0] = 'A'

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A

In [114]:
df2[df2 > 0] = 'B'
df2

C:\Users\DELL\AppData\Local\Temp\ipykernel_3108\416000018.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2 > 0] = 'B'

       Columna0 Columna1 Columna2
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B

In [115]:
df3[df3 > 0] = 'C'
df3

C:\Users\DELL\AppData\Local\Temp\ipykernel_3108\2590307496.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3 > 0] = 'C'

       Columna0 Columna1 Columna2
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [116]:
df4 = pd.concat([df1,df2,df3])
df4

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [117]:
df5 = pd.concat([df1,df2,df3], axis=1)
df5

,Columna0,Columna1,Columna2,Columna0,Columna1,Columna2,Columna0,Columna1,Columna2
Linea0,A,A,A,B,B,B,C,C,C
Linea1,A,A,A,B,B,B,C,C,C
Linea2,A,A,A,B,B,B,C,C,C

En esta aula, aprendimos:

Cómo seleccionar una variable del Dataframe (por ejemplo, datos['Tipo'] o datos.Tipo)
Que un Dataframe está compuesto de varios Series
Cómo eliminar duplicados (usando el método drop_duplicates())
Cómo redefinir el index de un Dataframe y Series (atributo index)
Cómo concatenar Dataframes (recordando el axis)
Cómo crear nuevos Dataframes basados ​​en estructuras de datos Python (lista, diccionarios o tuplas)